tests/tsung/increasing.xml
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd" []>
<tsung loglevel="warning">

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="30000000"/>
  </clients>

  <servers>
    <server host="localhost" port="8080" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="10" unit="second">
      <users arrivalrate="100" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="10" unit="second">
      <users arrivalrate="150" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="10" unit="second">
      <users arrivalrate="200" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="4" duration="10" unit="second">
      <users arrivalrate="250" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="5" duration="10" unit="second">
      <users arrivalrate="300" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="6" duration="10" unit="second">
      <users arrivalrate="350" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="7" duration="10" unit="second">
      <users arrivalrate="400" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="8" duration="10" unit="second">
      <users arrivalrate="450" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="9" duration="10" unit="second">
      <users arrivalrate="500" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="10" duration="10" unit="second">
      <users arrivalrate="550" unit="second"/>
    </arrivalphase>
  </load>

  <sessions>
    <session name="es_load" weight="1" type="ts_http">
      <request>
      <http url="/index.html"
              method="GET" />
      </request>
    </session>
  </sessions>
</tsung>